tutorials/multiLayerPBF/Al10SiMg/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam);

beam
{
    pathName            scanPath;
 
    absorptionModel     Kelly;    
    KellyCoeffs
    {
        geometry        cone;
        eta0            0.15;
        etaMin          0.2;
    }   

    heatSourceModel     modifiedSuperGaussian;
    modifiedSuperGaussianCoeffs
    {
        dimensions      (50.0e-6 50.0e-6 30e-6);
        m               3.0;
        k               8.0;
        transient       true;
        isoValue        865.0;
        nPoints         (10 10 10);
    }
}

// ************************************************************************* //
