tutorials/multiLayerPBF/Al10SiMg/constant/thermoPath
(
829.0    1.0000
865.0    0.0000
)
