tutorials/multiLayerPBF/Al10SiMg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solid
{
    kappa   (112.0  1.07e-5   0.0);
    Cp      (7.557e+02   4.550e-01   0.0);
}

liquid
{
    kappa   (112.0  1.07e-5   0.0);
    Cp      (1.149e+03   3.999e-03   0.0);
}

powder
{
    kappa   (112.0  1.07e-5   0.0);
    Cp      (7.557e+02   4.550e-01   0.0);
}

//- fluid flow properties
rho     [1 -3 0 0 0 0 0]    2699.0;
mu      [1 -1 -1  0 0 0 0]  0.0013;
beta    [0 0 0 -1 0 0 0]    1.0e-4;
DAS     [0 1 0 0 0 0 0]     10e-6;
Lf      [0  2 -2  0 0 0 0]  4.22e5;

// ************************************************************************* //
